IDEA Open Model
ReinforcedCrossSection.Bars Property
 Reinforced bars
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<ReinforcedBar> Bars { get; set; }
Public Property Bars As List(Of ReinforcedBar)
	Get
	Set
public:
property List<ReinforcedBar^>^ Bars {
	List<ReinforcedBar^>^ get ();
	void set (List<ReinforcedBar^>^ value);
}
Property Value
Type: List<ReinforcedBar>
See Also
Reference
ReinforcedCrossSection Class
IdeaRS.OpenModel.CrossSection Namespace